@extends('layouts.app')

@push('styles')
    <style>
        .side {
            background: linear-gradient(346deg, #8db960 0%, #c7e7a6 100%);
        }

        .lang {
            display: flex;
            gap: 6px;
            outline: none;
        }
    </style>
@endpush

@section('content')
    <main class="h-screen w-full bg-white flex flex-row justify-center py-[20px] px-[40px]  gap-10">
        {{-- Side Section --}}
        <div class="hidden lg:block 2xl:w-2/5 w-1/2 min-h-[400px] max-w-[940px] h-full">
            <div class="relative side h-full rounded-3xl">
                <div class="pt-[5.5rem] px-4 sm:px-[4.25rem]">
                    <h2 class="text-2xl sm:text-3xl font-semibold text-primary-dark mb-5 text-center sm:text-right">مرحبًا
                        بعودتك!</h2>
                    <p dir="rtl"
                        class="text-[13px] leading-6 text-primary-dark max-w-[32rem] ml-auto text-center sm:text-right">
                        خدمات متكاملة للتجارة الإلكترونية تبدأ من الاستيراد وتنتهي بالتسليم… نحن شريكك للنجاح في الشرق
                        الأوسط.
                    </p>

                    @yield('sideContent')

                </div>
                <img src="assets/auth/decoration.svg"
                    class="absolute bottom-0 left-0 max-w-[150px] sm:max-w-[250px] xl:max-w-[400px] h-auto " />
            </div>
        </div>

        {{-- Auth Section --}}
        <div class=" w-full lg:w-1/2 2xl:w-3/5 min-h-[830px] lg:max-w-[600px] flex flex-col">
            <div class="flex justify-between items-center mt-6 flex-wrap gap-4  mb-[40px]">
                <button class="lang flex items-center outline-none">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"
                        fill="none">
                        <path
                            d="M12 23.25C10.4517 23.25 8.99334 22.9542 7.62501 22.3625C6.25667 21.77 5.06501 20.9658 4.05001 19.95C3.03501 18.9342 2.23084 17.7425 1.63751 16.375C1.04417 15.0075 0.74834 13.5492 0.750007 12C0.750007 10.4467 1.04584 8.98708 1.63751 7.62125C2.23001 6.25458 3.03417 5.06417 4.05001 4.05C5.06584 3.03583 6.25751 2.23167 7.62501 1.6375C8.99334 1.04583 10.4517 0.75 12 0.75C13.5533 0.75 15.0129 1.04583 16.3788 1.6375C17.7454 2.23 18.9363 3.03417 19.9513 4.05C20.9663 5.06583 21.77 6.25625 22.3625 7.62125C22.9542 8.98792 23.25 10.4475 23.25 12C23.25 13.5483 22.9542 15.0067 22.3625 16.375C21.77 17.7433 20.9658 18.935 19.95 19.95C18.9342 20.965 17.7438 21.7692 16.3788 22.3625C15.0138 22.9558 13.5542 23.2517 12 23.25ZM12 22.01C12.7333 21.0675 13.3383 20.1421 13.815 19.2338C14.2908 18.3254 14.6779 17.3088 14.9763 16.1838H9.02376C9.35459 17.3721 9.74959 18.4204 10.2088 19.3288C10.6688 20.2371 11.2658 21.1308 12 22.01ZM10.4088 21.8225C9.82542 21.135 9.29292 20.285 8.81126 19.2725C8.32959 18.2608 7.97126 17.2308 7.73626 16.1825H2.94251C3.65917 17.7367 4.67459 19.0117 5.98876 20.0075C7.30376 21.0025 8.77709 21.6075 10.4088 21.8225ZM13.5913 21.8225C15.2229 21.6075 16.6963 21.0025 18.0113 20.0075C19.3254 19.0117 20.3408 17.7367 21.0575 16.1825H16.265C15.9483 17.2467 15.5496 18.2846 15.0688 19.2962C14.5871 20.3088 14.0946 21.1517 13.5913 21.8225ZM2.43251 14.9338H7.47626C7.38126 14.4204 7.31459 13.9204 7.27626 13.4338C7.23626 12.9479 7.21626 12.47 7.21626 12C7.21626 11.53 7.23584 11.0521 7.27501 10.5662C7.31417 10.0804 7.38084 9.58042 7.47501 9.06625H2.43376C2.29792 9.49958 2.19167 9.97167 2.11501 10.4825C2.03834 10.9925 2.00001 11.4983 2.00001 12C2.00001 12.5017 2.03792 13.0079 2.11376 13.5188C2.18959 14.0296 2.29584 14.5008 2.43251 14.9325M8.72626 14.9325H15.2738C15.3688 14.42 15.4354 13.9283 15.4738 13.4575C15.5138 12.9875 15.5338 12.5017 15.5338 12C15.5338 11.4983 15.5142 11.0125 15.475 10.5425C15.4358 10.0725 15.3692 9.58083 15.275 9.0675H8.72501C8.63084 9.58 8.56417 10.0717 8.52501 10.5425C8.48584 11.0125 8.46626 11.4983 8.46626 12C8.46626 12.5017 8.48584 12.9875 8.52501 13.4575C8.56417 13.9275 8.63209 14.4192 8.72626 14.9325ZM16.525 14.9325H21.5675C21.7033 14.5 21.8096 14.0288 21.8863 13.5188C21.9621 13.0079 22 12.5017 22 12C22 11.4983 21.9621 10.9921 21.8863 10.4812C21.8104 9.97042 21.7042 9.49917 21.5675 9.0675H16.5238C16.6188 9.58 16.6854 10.0796 16.7238 10.5662C16.7638 11.0529 16.7838 11.5308 16.7838 12C16.7838 12.4692 16.7642 12.9471 16.725 13.4338C16.6858 13.9204 16.6192 14.4204 16.525 14.9338M16.265 7.8175H21.0575C20.325 6.23083 19.3217 4.95583 18.0475 3.9925C16.7733 3.02917 15.2879 2.41625 13.5913 2.15375C14.1746 2.92125 14.6992 3.79917 15.165 4.7875C15.6308 5.775 15.9975 6.785 16.265 7.8175ZM9.02376 7.8175H14.9763C14.6463 6.64417 14.2392 5.58333 13.755 4.635C13.2708 3.68667 12.6858 2.805 12 1.99C11.3142 2.80417 10.7292 3.68583 10.245 4.635C9.76084 5.58417 9.35292 6.645 9.02376 7.8175ZM2.94376 7.8175H7.73626C8.00376 6.78583 8.37042 5.77583 8.83626 4.7875C9.30209 3.79917 9.82667 2.92125 10.41 2.15375C8.69834 2.41708 7.20917 3.03375 5.94251 4.00375C4.67584 4.97542 3.67584 6.24625 2.94251 7.81625"
                            fill="#626262" />
                    </svg>
                    <span class="text-[18px] sm:text-[20px] text-[#626262]">English</span>
                </button>

                <a href="{{ url('/') }}" class="cursor-pointer">
                    <img src="assets/icons/green.svg" alt="Logo" class="max-w-[100px] h-auto" />
                </a>
            </div>

            <x-auth.auth-toggle :loginActive="Route::currentRouteName() === 'login'" />
            {{-- side block for sm-only --}}
            <div class="lg:hidden">
                <div class=" px-4 sm:px-[4.25rem] mb-8">
                    <h2 class="text-2xl sm:text-3xl font-semibold text-primary-dark mb-5 text-center">
                        مرحبًا بعودتك!
                    </h2>
                    <p dir="rtl" class="text-[13px] leading-6 text-primary-dark max-w-[32rem] mx-auto text-center ">
                        خدمات متكاملة للتجارة الإلكترونية تبدأ من الاستيراد وتنتهي بالتسليم…
                        نحن شريكك للنجاح في الشرق الأوسط.
                    </p>

                    @yield('sideContent')
                </div>

            </div>
            <div class='max-h-[600px] overflow-y-scroll'>

                @yield('authContent')
            </div>

        </div>
    </main>

    @push('scripts')
        <script></script>
    @endpush
@endsection
